tutorials/multicomponentFluid/parcelInBox/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 0.1)
    (1 0 0.1)
    (1 1 0.1)
    (0 1 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (5 5 5) simpleGrading (1 1 1)
);

boundary
(
    outlet
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    inlet
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
        );
    }
    back
    {
        type symmetryPlane;
        faces
        (
            (0 3 2 1)
        );
    }
    front
    {
        type symmetryPlane;
        faces
        (
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
